In [1]:
import pandas as pd

In [2]:
employeeData = pd.read_csv('Employees.csv')

In [3]:
employeeData

    Name  Gender      Age  Salary(USD)
0    Mark      M  20.3650         1000
1   John       M  60.3226         1200
2  Edward      M  42.2650         3000
3   Salah      M  31.3800         5000
4   Ahmed      M  42.6800         1700
5    Sara      F  25.3640         1900
6   Julia      F  21.2857         1950
7   John       M  60.3226         1200
8    Mark      M  20.3650         1000

#### Remove any duplicates in the table

In [4]:
df = pd.DataFrame(employeeData)

In [5]:
df.drop_duplicates(inplace=True)

#### Remove any decimal places in the Age column

In [6]:
df['Age'] = df['Age'].astype(int)

In [7]:
df

    Name  Gender  Age  Salary(USD)
0    Mark      M   20         1000
1   John       M   60         1200
2  Edward      M   42         3000
3   Salah      M   31         5000
4   Ahmed      M   42         1700
5    Sara      F   25         1900
6   Julia      F   21         1950

#### Convert the USD salary to EGP

In [8]:
USD_To_EGP = 48.05
df['Salary(USD)'] = df['Salary(USD)'] * USD_To_EGP
df.rename(columns={'Salary(USD)': 'Salary(EGP)'}, inplace=True)

In [9]:
df

    Name  Gender  Age  Salary(EGP)
0    Mark      M   20      48050.0
1   John       M   60      57660.0
2  Edward      M   42     144150.0
3   Salah      M   31     240250.0
4   Ahmed      M   42      81685.0
5    Sara      F   25      91295.0
6   Julia      F   21      93697.5

### Print in the console some stats like:

####  Average age

In [10]:
Avg_Ages = df['Age'].mean()
print("\nAverage of ages = ", Avg_Ages)

Average of ages =  34.42857142857143

#### Median Salaries

In [11]:
median_salaries = df['Salary(EGP)'].median()
print("\nMedian of Salaries (EGP) = ", median_salaries)

Median of Salaries (EGP) =  91295.0

#### Ration between males and female employees

In [12]:
male_count = 0
female_count = 0

for gender in df['Gender']:
    if gender == 'M':
        male_count += 1
    elif gender == 'F':
        female_count += 1

ratio_male_to_female = male_count / female_count

print("Female Count:", female_count)
print("Male Count:", male_count)
print("\nRatio of Males to Females = ", ratio_male_to_female)

Female Count: 2
Male Count: 5

Ratio of Males to Females =  2.5

### write the data in a new CSV file

In [13]:
newDf = pd.DataFrame({
    'Average Age': [Avg_Ages],
    'Median Salaries': [median_salaries],
    'Ratio of Males to Females': [ratio_male_to_female]
})

In [14]:
newDf

   Average Age  Median Salaries  Ratio of Males to Females
0    34.428571          91295.0                        2.5

In [15]:
newDf.to_csv('dataOperations.csv', index=False)

In [16]:
df.to_csv('newEmployee.csv', index=False)

In [17]:
newEmployeeData = pd.read_csv('newEmployee.csv')

In [18]:
newEmployeeData

    Name  Gender  Age  Salary(EGP)
0    Mark      M   20      48050.0
1   John       M   60      57660.0
2  Edward      M   42     144150.0
3   Salah      M   31     240250.0
4   Ahmed      M   42      81685.0
5    Sara      F   25      91295.0
6   Julia      F   21      93697.5